james-api/app/controllers/subscriptions_controller.rb

SELECT  "glx_subscriptions".* FROM "glx_subscriptions" WHERE "glx_subscriptions"."uuid" = $1 ORDER BY "glx_subscriptions"."id" ASC LIMIT $2  [["uuid", "74ac3f97-72af-4c41-a4dc-9806ba6d7d13"], ["LIMIT", 1]]
UPDATE "glx_subscriptions" SET "unsubscribed_at" = $1, "subscribed" = $2 WHERE "glx_subscriptions"."id" = $3  [["unsubscribed_at", "2018-06-30 02:20:02.876521"], ["subscribed", "f"], ["id", 1]]
---
  def unsubscribe
    subscription = GlxSubscription.where(uuid: params[:uuid]).first
    if subscription.nil?
      @message = "Invalid code, please verify that the code entered in the url or try later."
    else
      subscription.unsubscribed_at = Time.now
      subscription.subscribed = false
      subscription.save