james-api/app/controllers/webhooks_controller.rb

SELECT  "glx_mails".* FROM "glx_mails" WHERE "glx_mails"."mail_name" = $1 LIMIT $2  [["mail_name", "Mail1528833279459-cbdef0a5-a995-4f24-babd-dd5760e1797e"], ["LIMIT", 1]]
SELECT  "glx_sendgrid_mail_infos".* FROM "glx_sendgrid_mail_infos" WHERE "glx_sendgrid_mail_infos"."sendgrid_id" = $1 LIMIT $2  [["sendgrid_id", "GfqbKymrQxSYFlns17I4IA.filter0041p3mdw1-11859-5B2018C3-19.0"], ["LIMIT", 1]]
SELECT  1 AS one FROM "glx_sendgrid_mail_infos" WHERE "glx_sendgrid_mail_infos"."glx_mail_id" = $1 LIMIT $2  [["glx_mail_id", 6], ["LIMIT", 1]]
INSERT INTO "glx_sendgrid_mail_infos" ("sendgrid_id", "glx_mail_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sendgrid_id", "bR6WzLqaSSWIWaWZc2Emqw.filter0065p3mdw1-17520-5B202ED1-21.0"], ["glx_mail_id", 6], ["created_at", "2018-06-12 20:36:41.549388"], ["updated_at", "2018-06-12 20:36:41.549388"]]
UPDATE "glx_mails" SET "status_id" = $1 WHERE "glx_mails"."id" = $2  [["status_id", 17], ["id", 9]]
---
  def sendgrid
    params["_json"].each do |obj|
      mail_name = obj["mail_name"] rescue nil
      next unless mail_name # return if mail is test mail
      sendgrid_id = obj["sg_message_id"]
      if mail_name
        email = GlxMail.find_by_mail_name(mail_name)
        return if email.nil?
        unless GlxSendgridMailInfo.exists?(glx_mail_id: email.id)
          GlxSendgridMailInfo.create(glx_mail_id: email.id, sendgrid_id: sendgrid_id)
        end
      else
        email = GlxSendgridMailInfo.get_mail_from_sendgrid_id(sendgrid_id)
      end
      # set the final status
      action = obj["event"]
      action = action.capitalize
      email.current_action = action
      email.log_timestamp = obj["timestamp"]
      final_status_id = GlxMachineStatus.get_status_from_initial_status_and_action(email.status_id, action) rescue 0
      if final_status_id != 0
        email.update_attribute(:status_id, final_status_id)

UPDATE "glx_mails" SET "status_id" = $1 WHERE "glx_mails"."id" = $2  [["status_id", 5], ["id", 20]]
---
  def ses
    @data ||= JSON.parse request.raw_post

    # confirm the endpoint
    if @data["SubscribeURL"]
      url = URI.parse(@data["SubscribeURL"])
      req = Net::HTTP::Get.new(url.to_s)
      res = res = Net::HTTP.start(url.host, url.port,
                                  :use_ssl => url.scheme == 'https') {|http| http.request req}
    end
    info = @data["Message"] rescue nil
    if info
      info = JSON.parse(info)
      action = info["notificationType"]
      mail_id = info["mail"]['messageId'] rescue nil
      return unless mail_id # return if mail is test mail

      email = GlxAwsSesMailInfo.get_mail_from_aws_ses_id(mail_id)
      email.current_action = action
      email.log_timestamp = info["mail"]["timestamp"].to_datetime.to_i rescue Time.now.getutc
      final_status_id = GlxMachineStatus.get_status_from_initial_status_and_action(email.status_id, action) rescue 0
      if final_status_id != 0
        email.update_attribute(:status_id, final_status_id)